---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.InstanceFreeHostParam
source: html/0056078a-78cc-72ff-024f-5721cb2eaa25.htm
---
# Autodesk.Revit.DB.ParameterTypeId.InstanceFreeHostParam Property

"Host"

## Syntax (C#)
```csharp
public static ForgeTypeId InstanceFreeHostParam { get; }
```